#include<iostream>
using namespace std;
int main()
{
    /*for (int i = 123; i <= 333; i++)
    {
        cout<<i<<" "<<i*2<<" "<<i*3<<endl;
    }
    
    cout<<"192 384 576"<<endl;
    cout<<"219 438 657"<<endl;
    cout<<"273 546 819"<<endl;
    cout<<"327 654 981"<<endl;
    */
   //所有的数的和和乘积完全相等
   for (int i = 123; i <= 329; i++)
   {
        if(45==i%10+i/10%10+i/100+2*i%10+2*i/10%10+2*i/100+3*i%10+3*i/10%10+3*i/100 &&362880==(i%10)*(i/10%10)*(i/100)*(2*i%10)*(2*i/10%10)*(2*i/100)*(3*i%10)*(3*i/10%10)*(3*i/100))
        {
            cout<<i<<" "<<i*2<<" "<<i*3<<endl;
        }
   }
   
}

